mwg.wb.webapi/soapxml/GetPromotionBHXByPromotionId.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <AuthenSoapHeader xmlns="http://tempuri.org/">
      <GUID>string</GUID>
      <AuthenData>{AuthenData}</AuthenData>
      <DelegatingUser>"null"</DelegatingUser>
      <LanguageID>1</LanguageID>
      <ModuleID>1</ModuleID>
    </AuthenSoapHeader>
  </soap:Header>
  <soap:Body>
    <GetPromotionById xmlns="http://tempuri.org/">
      <intPromotionId>{intPromoId}</intPromotionId>
      <intStroreId>{intStoreId}</intStroreId>
    </GetPromotionById>
  </soap:Body>
</soap:Envelope>